ruby/cours_2/app/controllers/offers_controller.rb

  def index
    @offers = Offer.all
---
SELECT "offers".* FROM "offers"

  def create
    @offer = Offer.new(offer_params)

    respond_to do |format|
      if @offer.save
---
INSERT INTO "offers" ("title", "description", "published_at", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "lol"], ["description", "xD"], ["published_at", "2016-05-11 14:52:18.772287"], ["price", 1.0], ["created_at", "2016-05-11 14:52:18.775375"], ["updated_at", "2016-05-11 14:52:18.775375"]]

  def update
    respond_to do |format|
      if @offer.update(offer_params)
---
UPDATE "offers" SET "description" = ?, "updated_at" = ? WHERE "offers"."id" = ?  [["description", "prout"], ["updated_at", "2016-05-11 10:54:17.433996"], ["id", 1]]

  def destroy
    @offer.destroy
---
DELETE FROM "offers" WHERE "offers"."id" = ?  [["id", 3]]

    def set_offer
      @offer = Offer.find(params[:id])
---
SELECT  "offers".* FROM "offers" WHERE "offers"."id" = ? LIMIT 1  [["id", 3]]