ruby/cours_2/app/controllers/welcome_controller.rb

SELECT  "offers".* FROM "offers" WHERE ("offers"."published_at" IS NOT NULL)  ORDER BY "offers"."published_at" DESC LIMIT 5
---
  def home
  	@offers = Offer.where.not(published_at: nil).order(published_at: "DESC").limit(5)